Revit 2027 API
BuiltInFailures.GeneralFailures.InternalProblemsParameter Property
 Parameter cannot be changed due to internal problems.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InternalProblemsParameter { get; }
Public Shared ReadOnly Property InternalProblemsParameter As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InternalProblemsParameter {
	FailureDefinitionId^ get ();
}
static member InternalProblemsParameter : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace